//
//  Zodiac.swift
//  ZodiacApp
//
//  Created by Bakar Kharabadze on 4/10/24.
//

import Foundation

struct Zodiac {
    let name: String
    let description: String
    let polarSign: String
    let imageName: String
}

let zodiacs: [Zodiac] = [
    Zodiac(name: "ვერძი", description: "პლანეტა მარსის გავლენით, რომელიც ზოდიაქოს ამ ნიშნის მმართველად ითვლება, ვერძებს დაუშრეტელი ენერგია, გასაოცარი სიცოცხლისუნარიანობა და უჩვეულო ოპტიმიზმი ახასიათებთ. ამ ადამიანების ხასიათში ერთმანეთს ერწყმის, ბავშვური გულწრფელობა და ბრძოლისუნარიანობა, აგრესია და გულუბრყვილობა.", polarSign: "სასწორი", imageName: "ვერძი"),
    
    Zodiac(name: "კურო", description: "ადამიანები, რომელთაც ბედმა კუროს ზოდიაქოს ნიშნით დაბადება არგუნა წილად, როგორც წესი სხვებისგან მშვიდი, გაწონასწორებული და უშფოთველი იმიჯით გამოირჩევიან. მათი ცნობა გარეგნობის მიხედვით, ადვილზე ადვილი საქმეა. კარგი აღნაგობის, ძვალმსხვილი, ხშირად ჩასუქებული.. უჩვეულოდ ლამაზი, მეტყველი თვალებით და საოცრად ნათელი, მშვიდი მზერით.", polarSign: "მორიელი", imageName: "კურო"),
    
    Zodiac(name: "ტყუპები", description: "ტყუპების ზოდიაქოს ნიშნით დაბადებული ადამიანები, ზოდიაქოს ამ ნიშნის სიმბოლოს -ხელიხელჩაკიდებული მითიური ძმების კასტორის და პოლუქსის მგსავსად, გაორებულობით გამოირჩევიან. ისინი, მრავალმხრივი, ცვალებადი, მოუსვენარი, ცნობისმოყვარე და მერყევი ბუნების პიროვნებები არიან. ტიპიური ტყუპს, მიუხედავად იმისა, რომ ხშირად საკუთარი თავის ვერაფერი გაუგია, გამუდმებით აინტერესებს სხვისი ცხოვრების დეტალები.", polarSign: "მშვილდოსანი", imageName: "ტყუპები"),
    
    Zodiac(name: "კირჩხიბი", description: "კირჩხიბის ზოდიაქოს ნიშნით, ყველაზე ამოუცნობი, მგრძნობიარე და ინტუიტიური ადამიანები იბადებიან. კირჩხიბს მთვარე მართავს, აქედან გამომდინარე მთვარის ფაზების შესაბამისად , ამ ადამანების ხასიათიც ანალოგიური ტემპებით და სიხშირით იცვლება. მთვარის გავლენითაა განპირობებული, ისიც რომ კირჩხიბების უმრავლესობას, ხშირად ესაჭიროება განმარტოება და საკუთარ თავში ჩაღრმავება.", polarSign: "თხის რქა", imageName: "კირჩხიბი"),
    
    Zodiac(name: "ლომი", description: "„ადამიანი დღესასწაული“ - ასე შემიძლია, ორი სიტყვით დავახასიათო, ადამიანები რომელთაც ბედმა, ლომის ზოდიაქოს ნიშნით დაბადება არგუნა წილად. ლომი გულით იმართება, ამიტომ ზოდიაქოს ამ ნიშნის წარმამადგენლებისთვის, ცხოვრებაში ყველაფერი „გულზე გადის“. მათი გასაოცარი სიცოცხლისუნარიანობა, ენერგია და ტემპერამენტი ბევრ ადამიანზე სტიმულის მომცემად და პოზიტიურად მოქმედებს.", polarSign: "მერწყული", imageName: "ლომი"),
    
    Zodiac(name: "ქალწული", description: "პლანეტა მერკურის გავლენის ქვეშ დაბადებული ქალწულები, მოწესრიგებულობით, უზადო პასუხისმგებლობის გრძნობით და წვრილმანების მიმართ გასაოცარი ყურადღებიანობით გამოირჩევიან. ზოდიაქოს სხვა ნიშნის წარმომადგენლებს შორის, ქალწულის ცნობა მისი უნაკლო ჩაცმულობით, დავარცხნილ-გაწკრიალებული გარეგნობით და ზრდილობიანი მანერებით შეიძლება. ქალწულებს შორის როგორც წესი, ტანმორჩილი ხალხი სჭარბობს.", polarSign: "თევზები", imageName: "ქალწული"),
    
    Zodiac(name: "სასწორი", description: "სასწორის ზოდიაქოს ნიშნით დაბადებული ადამიანები, პლანეტა ვენერას გავლენის ქვეშ იმყოფებიან, რაც მათ ხასიათში თანდაყოლილ დიპლომატიის უანრს, ჰარმონიის და სილამაზის სიყვარულს განაპირობებს. სასწორების უმრავლესობა, როგორც გარეგნობით ისე ხასიათით, სასიამოვნო და კომუნიკაბელური ხალხია. ორივე სქესის სასწორებს, ძალიან უყვართ კამათი, შესაბამისად მათთვის უცხო არ არის სხვადასხვა სახის დისკუსიებსა და პოლემიკებში მონაწილეობის მიღების სიყვარული.", polarSign: "ვერძი", imageName: "სასწორი"),
    
    Zodiac(name: "მორიელი", description: "მორიელის ზოდიაქოს ნიშნით დაბადებულ ადამიანებს თანდაყოლილი სიმამაცე, პრინციპულობა, ამტანობა და გარშემომყოფებით გასაოცარი მანიპულაციის უნარი გააჩნიათ. ნებისმიერი ადამიანის დაბადებას, რომელიც 24 ოქტომბრიდან 22 ნოემბრის შუალედში ევლინება ქვეყანას, როგორც წესი, ოჯახსა და სანათესაოში ვინმეს გარდაცვალება უსწრებს წინ.", polarSign: "კურო", imageName: "მორიელი"),
    
    Zodiac(name: "მშვილდოსანი", description: "მშვილდოსნის ზოდიაქოს წარმატების და იღბლის მომტანი პლანეტა იუპიტერი მფარველობს. აქედან გამომდინარე, გასაკვირი არ არის ის ფაქტი, რომ ადამიანები, რომლებიც ზოდიაქოს ამ ნიშნით მოევლინენ ქვეყანას, უსაზღვრო ოპტიმიზმითა და პოზიტიური ხასიათის თვისებებით არიან დაჯილდოვებულნლი. საზოგადოებაში, მშვილდოსნის ცნობა ძალზე მარტივია მისი საქციელის და მანერების მიხედვით.", polarSign: "ტყუპები", imageName: "მშვილდოსანი"),
    
    Zodiac(name: "თხის რქა", description: "თხის რქის ზოდიაქოს ნიშნით როგორც წესი, ყველაზე პრინციპული, გასაოცარი ამტანობით გამორჩეული და უზომოდ შრომისმოყვარე ადამიანები იბადებიან. პლანეტა სატურნი, რომელიც ზოდიაქოს ამ ნიშნის მფარველად ითვლება, თავის შვილებს დისცილინირებულობას, მოვალეობის გამძაფრებულ შეგრძნებას და წესრიგის სიყვარულს ანიჭებს.", polarSign: "კირჩხიბი", imageName: "თხის რქა"),
    
    Zodiac(name: "მერწყული", description: "ადამიანები, რომლებიც მერწყულის ზოდიაქოს ნიშნით ევლინებიან ქვეყანას, ხასიათის მრავალმხრივობით გამოირჩევიან. მერწყულს ერთბაშად ორი პლანეტა მართავს, ბისექსუალური ენერგეტიკით დამუხტული ურანი და გამოკვეთილი მამაკაცური თვისებების მქონე სატურნი.", polarSign: "ლომი", imageName: "მერწყული"),
    
    Zodiac(name: "თევზები", description: "თევზები ზოდიაქოს ბოლო ნიშანია. აქედან გამომდინარე, ნუ გაგაკვირვებთ ის ფაქტი, თუ ამ ადამიანების ხასიათში წინამორბედი თერთმეტი ზოდიაქოს ნიშნისთვის დამახასიათებელ ამა თუ იმ თვისებას აღმოაჩენთ.", polarSign: "ქალწული", imageName: "თევზები")
]
